---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetMapOfAllSizesForStraights
source: html/34ceb348-135f-4349-b04d-814763d3bff7.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetMapOfAllSizesForStraights Method

Get a set of FabricationPartSizeMapSet of all straight sizes for all services.

## Syntax (C#)
```csharp
public ISet<FabricationPartSizeMap> GetMapOfAllSizesForStraights()
```

## Returns
Returns the map of sizes for straights or an empty map if there are none.